In [2]:
import pandas as pd

## Ejercicio 1

In [3]:
dic = {
    "Titulo": ["El Quijote", "Cien años de soledad", "La odisea"], 
    "Autor" : ["Miguel de Cervantes", "Gabriel García Márquez", "Homero"], 
    "Año": [1605, 1967, -800]
}
libros_df = pd.DataFrame(dic)

## Ejercicio 2

In [4]:
data = {
    'Nombre': ['Ana', 'Luis', 'Carlos', 'Sara'],
    'Edad': [25, 30, 22, 27],
    'Ciudad': ['Madrid', 'Barcelona', 'Valencia', 'Bilbao']
}
df = pd.DataFrame(data)
df_filtrado = df[df['Edad'] >= 25]
df_filtrado

  Nombre  Edad     Ciudad
0    Ana    25     Madrid
1   Luis    30  Barcelona
3   Sara    27     Bilbao

## Ejercicio 3

In [5]:
data = {
    'Nombre': ['Ana', 'Luis', 'Carlos', 'Sara'],
    'Edad': [25, 30, 22, 27],
    'Ciudad': ['Madrid', 'Barcelona', 'Valencia', 'Bilbao']
}
df = pd.DataFrame(data)
df["Edad_en_10_años"] = df["Edad"] + 10
df["Ciudad"] = df['Ciudad'].str.upper()
df["Es_Mayor_de_25"] = df["Edad"] >= 25
df

   Nombre  Edad     Ciudad  Edad_en_10_años  Es_Mayor_de_25
0     Ana    25     MADRID               35            True
1    Luis    30  BARCELONA               40            True
2  Carlos    22   VALENCIA               32           False
3    Sara    27     BILBAO               37            True

## Ejercicio 4

In [6]:
datos = {
    'titulo': ['Pelicula A', 'Pelicula B', 'Pelicula C', 'Pelicula D'],
    'año': [2001, 2000, 2005, 2010],
    'rating': [7.2, 6.5, 8.1, 7.5]
}
df = pd.DataFrame(datos)
df_ordenado = df.sort_values('año')

## Ejercicio 5

In [7]:
datos = {
    'titulo': ['Pelicula A', 'Pelicula B', 'Pelicula C', 'Pelicula D'],
    'año': [2001, 2000, 2005, 2010],
    'rating': [7.2, 6.5, 8.1, 7.5]
}
df = pd.DataFrame(datos)
df_ordenado = df.sort_values('rating', ascending=False)

## Ejercicio 6

In [8]:
datos = {
    'titulo': ['Pelicula A', 'Pelicula B', 'Pelicula C', 'Pelicula D', 'Pelicula E'],
    'género': ['Acción', 'Drama', 'Acción', 'Comedia', 'Drama'],
    'rating': [7.2, 8.5, 9.1, 6.5, 7.8]
}
df = pd.DataFrame(datos)
promedio_rating_por_genero = df.groupby('género')['rating'].mean()
promedio_rating_por_genero

género
Acción     8.15
Comedia    6.50
Drama      8.15
Name: rating, dtype: float64

## Ejercicio 7

In [9]:
libros = pd.DataFrame({
    'ID': [1, 2, 3, 4],
    'titulo': ['El Quijote', 'La Odisea', 'Cien Años de Soledad', 'El Principito']
})

autores = pd.DataFrame({
    'ID': [1, 2, 3, 5],
    'nombre': ['Miguel de Cervantes', 'Homero', 'Gabriel García Márquez', 'J.K. Rowling']
})

libros_autores = pd.merge(libros, autores, on='ID', how = 'outer')
libros_autores

   ID                titulo                  nombre
0   1            El Quijote     Miguel de Cervantes
1   2             La Odisea                  Homero
2   3  Cien Años de Soledad  Gabriel García Márquez
3   4         El Principito                     NaN
4   5                   NaN            J.K. Rowling

## Ejercicio 8

In [10]:
cursos = pd.DataFrame({
    'curso_id': [101, 102, 103],
    'nombre_curso': ['Introducción a Python', 'Data Science con Python', 'Machine Learning Avanzado']
})

inscripciones = pd.DataFrame({
    'curso_id': [102, 102, 101, 104],
    'fecha_inscripcion': ['2023-01-15', '2023-02-01', '2023-01-20', '2023-03-05']
})

cursos_inscripciones = pd.merge(inscripciones, cursos, on = 'curso_id', how = 'left')
cursos_inscripciones

   curso_id fecha_inscripcion             nombre_curso
0       102        2023-01-15  Data Science con Python
1       102        2023-02-01  Data Science con Python
2       101        2023-01-20    Introducción a Python
3       104        2023-03-05                      NaN

## Ejercicio 9

In [11]:
productos = pd.DataFrame({
    'ID': [10, 11, 12],
    'Nombre': ['Teclado', 'Mouse', 'Monitor'],
    'Marca': ['Logitech', 'Razer', 'Dell']
})

reviews = pd.DataFrame({
    'ID': [10, 11, 12],
    'Calificación': [5, 4, 4],
    'Comentario': ['Excelente producto', 'Buen producto', 'Satisfecho']
})

productos_reviews = pd.merge(productos, reviews, how = 'outer', right_index=True, left_index=True )
productos_reviews

   ID_x   Nombre     Marca  ID_y  Calificación          Comentario
0    10  Teclado  Logitech    10             5  Excelente producto
1    11    Mouse     Razer    11             4       Buen producto
2    12  Monitor      Dell    12             4          Satisfecho

## Ejercicio 10

In [12]:
# Creación del DataFrame df_a
df_a = pd.DataFrame({
    'id': [1, 2, 3],
    'Nombre': ['Ana', 'Beto', 'Carla']
})
df_a.set_index('id', inplace=True)

# Creación del DataFrame df_b
df_b = pd.DataFrame({
    'id': [1, 2, 3],
    'Edad': [25, 30, 35]
})
df_b.set_index('id', inplace=True)

df_combinado = df_a.join(df_b)
df_combinado

   Nombre  Edad
id
1     Ana    25
2    Beto    30
3   Carla    35

## Ejercicio 11

In [13]:
productos_df = pd.DataFrame({
    'ProductoID': [1, 2, 3, 4],
    'Nombre': ['Producto 1', 'Producto 2', 'Producto 3', 'Producto 4'],
    'Precio': [100, 150, 200, 250]
}).set_index('ProductoID')

categorias_df = pd.DataFrame({
    'CategoriaID': [1, 2],
    'NombreCategoria': ['Categoría 1', 'Categoría 2']
}).set_index('CategoriaID')
df_combinado = productos_df.join(categorias_df)
df_combinado

                Nombre  Precio NombreCategoria
ProductoID
1           Producto 1     100     Categoría 1
2           Producto 2     150     Categoría 2
3           Producto 3     200             NaN
4           Producto 4     250             NaN

## Ejercicio 12

In [14]:

productos_df = pd.DataFrame({
    'ProductoID': [1, 2, 3, 4],
    'Nombre': ['Producto 1', 'Producto 2', 'Producto 3', 'Producto 4'],
    'Precio': [100, 150, 200, 250]
})

productos_df = productos_df.set_index('ProductoID')

categorias_df = pd.DataFrame({
    'CategoriaID': [1, 2, 3],
    'NombreCategoria': ['Categoría 1', 'Categoría 2', 'Categoría 3']
}).set_index('CategoriaID')

df_combinado = categorias_df.join(productos_df, how = 'right')
df_combinado

           NombreCategoria      Nombre  Precio
ProductoID
1              Categoría 1  Producto 1     100
2              Categoría 2  Producto 2     150
3              Categoría 3  Producto 3     200
4                      NaN  Producto 4     250

## Ejercicio 13

In [15]:
ventas_enero = pd.DataFrame({'Producto': ["Manzanas", "Bananas", "Naranjas"], 'Cantidad': [300, 200, 150]})

ventas_febrero = pd.DataFrame({'Producto': ["Manzanas", "Bananas", "Naranjas"], 'Cantidad': [350, 210, 170]})

ventas_total = pd.concat([ventas_enero, ventas_febrero], ignore_index=True)
ventas_total

   Producto  Cantidad
0  Manzanas       300
1   Bananas       200
2  Naranjas       150
3  Manzanas       350
4   Bananas       210
5  Naranjas       170

## Ejercicio 14

In [16]:
datos_cliente = pd.DataFrame({'Nombre': ["Ana", "Luis", "Marta"], 'Edad': [34, 45, 28]})
compras_cliente = pd.DataFrame({'Producto': ["Libro", "Lápiz", "Cuaderno"], 'Precio': [15.50, 0.50, 2.00]})

info_cliente = pd.concat([datos_cliente, compras_cliente], axis = 1)
info_cliente

  Nombre  Edad  Producto  Precio
0    Ana    34     Libro    15.5
1   Luis    45     Lápiz     0.5
2  Marta    28  Cuaderno     2.0

## Ejercicio 15

In [18]:
tienda_a = pd.DataFrame({'Producto': ["Manzanas", "Bananas"], 'Cantidad': [500, 300]})
tienda_b = pd.DataFrame({'Producto': ["Naranjas", "Peras"], 'Cantidad': [400, 250]})

ventas_tienda = pd.concat([tienda_a, tienda_b], keys = ["Tienda A", "Tienda B"])
ventas_tienda

            Producto  Cantidad
Tienda A 0  Manzanas       500
         1   Bananas       300
Tienda B 0  Naranjas       400
         1     Peras       250

## Ejercicio 16

In [21]:
primera_semana_2024 = pd.date_range('20240101',periods=7, freq = 'D')
primera_semana_2024

DatetimeIndex(['2024-01-01', '2024-01-02', '2024-01-03', '2024-01-04',
               '2024-01-05', '2024-01-06', '2024-01-07'],
              dtype='datetime64[ns]', freq='D')

## Ejercicio 17

In [38]:
df = pd.read_csv('fechas.csv')
df['fecha'] = pd.to_datetime(df['fecha'], format="%Y-%M-%d")
df['fecha'] = df['fecha'].dt.strftime('%d/%M/%Y')
df['fecha']

0    01/01/2024
1    14/02/2024
2    01/03/2024
Name: fecha, dtype: object

## Ejercicio 18

In [ ]:
df = pd.read_csv('fechas.csv')
df['fecha'] = pd.to_datetime(df['fecha'], format='%Y-%M-%d')
df['fecha'] = df['fecha'] + pd.Timedelta(days=5)
df['fecha']

0    06/01/2024
1    19/02/2024
2    06/03/2024
Name: fecha, dtype: object

## Ejercicio 19

In [52]:
data = {
    'Fecha': ['2024-03-19', '2024-03-20', '2024-03-21', '2024-03-22', '2024-03-23', '2024-03-24'],
    'Producto': ['Manzanas', 'Peras', 'Naranjas', 'Plátanos', 'Uvas', 'Melocotones'],
    'Cantidad': [23, 15, 18, 30, 8, 20],
    'Precio': [1.2, 1.5, 1.0, 0.8, 2.0, 1.7]
}

def guarda_en_excel(df):
    df.to_excel('ventas1.xlsx')

df_ventas = pd.DataFrame(data)
guarda_en_excel(df_ventas)

## Ejercicio 20

In [53]:
data = {
    'Fecha': ['2024-03-19', '2024-03-20', '2024-03-21', '2024-03-22', '2024-03-23', '2024-03-24'],
    'Producto': ['Manzanas', 'Peras', 'Naranjas', 'Plátanos', 'Uvas', 'Melocotones'],
    'Cantidad': [23, 15, 18, 30, 8, 20],
    'Precio': [1.2, 1.5, 1.0, 0.8, 2.0, 1.7]
}
df_ventas = pd.DataFrame(data)

df_ventas['Fecha'] = pd.to_datetime(df_ventas['Fecha'], format = '%Y-%M-%d')
df_ventas['Fecha'] = df_ventas['Fecha'].dt.strftime('%d/%M/%Y')

def guardar_en_excel(df):
    df.to_excel('ventas2.xlsx')

guardar_en_excel(df_ventas)
df_ventas

        Fecha     Producto  Cantidad  Precio
0  19/03/2024     Manzanas        23     1.2
1  20/03/2024        Peras        15     1.5
2  21/03/2024     Naranjas        18     1.0
3  22/03/2024     Plátanos        30     0.8
4  23/03/2024         Uvas         8     2.0
5  24/03/2024  Melocotones        20     1.7

In [54]:
data = {
    'Fecha': ['2024-03-19', '2024-03-20', '2024-03-21', '2024-03-22', '2024-03-23', '2024-03-24'],
    'Producto': ['Manzanas', 'Peras', 'Naranjas', 'Plátanos', 'Uvas', 'Melocotones'],
    'Cantidad': [23, 15, 18, 30, 8, 20],
    'Precio': [1.2, 1.5, 1.0, 0.8, 2.0, 1.7]
}

df_ventas = pd.DataFrame(data)

df_ventas['Precio Total'] = df_ventas['Precio'] * df_ventas['Cantidad']

def guardar_en_csv(df):
    df.to_csv('ventas3.csv')

guardar_en_csv(df_ventas)
df_ventas

        Fecha     Producto  Cantidad  Precio  Precio Total
0  2024-03-19     Manzanas        23     1.2          27.6
1  2024-03-20        Peras        15     1.5          22.5
2  2024-03-21     Naranjas        18     1.0          18.0
3  2024-03-22     Plátanos        30     0.8          24.0
4  2024-03-23         Uvas         8     2.0          16.0
5  2024-03-24  Melocotones        20     1.7          34.0